{
  "articles": [
    {
      "title": "Finance Bill 2026: New tax proposals spark nationwide debate",
      "description": "Finance Bill 2026: New tax proposals spark nationwide debate. Finance Bill 2026 continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_finance_bill/1",
      "source": "The Star",
      "publishedAt": "2026-02-18T21:25:24.594880",
      "content": "Finance Bill 2026: New tax proposals spark nationwide debate. The Finance Bill 2026 has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the taxation sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "KRA targets Sh3.6 trillion revenue with expanded tax base",
      "description": "KRA targets Sh3.6 trillion revenue with expanded tax base. Finance Bill 2026 continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_finance_bill/2",
      "source": "The Star",
      "publishedAt": "2026-02-16T22:25:24.594880",
      "content": "KRA targets Sh3.6 trillion revenue with expanded tax base. The Finance Bill 2026 has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the taxation sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Youth groups mobilize against proposed tax hikes in Finance Bill",
      "description": "Youth groups mobilize against proposed tax hikes in Finance Bill. Finance Bill 2026 continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_finance_bill/3",
      "source": "Daily Nation",
      "publishedAt": "2026-02-18T17:25:24.594880",
      "content": "Youth groups mobilize against proposed tax hikes in Finance Bill. The Finance Bill 2026 has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the taxation sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Business community warns Finance Bill will hurt economy",
      "description": "Business community warns Finance Bill will hurt economy. Finance Bill 2026 continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_finance_bill/4",
      "source": "Daily Nation",
      "publishedAt": "2026-02-17T09:25:24.594880",
      "content": "Business community warns Finance Bill will hurt economy. The Finance Bill 2026 has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the taxation sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "MPs propose amendments to controversial Finance Bill clauses",
      "description": "MPs propose amendments to controversial Finance Bill clauses. Finance Bill 2026 continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_finance_bill/5",
      "source": "Business Daily",
      "publishedAt": "2026-02-16T10:25:24.594880",
      "content": "MPs propose amendments to controversial Finance Bill clauses. The Finance Bill 2026 has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the taxation sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    }
  ],
  "last_fetched": "2026-02-19T02:25:24.594880",
  "status": "ok",
  "query": "Finance Bill 2026"
}