{
  "articles": [
    {
      "title": "Housing Levy increase to 3% draws worker pushback",
      "description": "Housing Levy increase to 3% draws worker pushback. Housing Levy Increase continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_housing_levy/1",
      "source": "People Daily",
      "publishedAt": "2026-02-16T19:25:24.594880",
      "content": "Housing Levy increase to 3% draws worker pushback. The Housing Levy Increase has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the housing sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Affordable housing program delivers first 1,500 units in Nairobi",
      "description": "Affordable housing program delivers first 1,500 units in Nairobi. Housing Levy Increase continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_housing_levy/2",
      "source": "The Star",
      "publishedAt": "2026-02-16T22:25:24.594880",
      "content": "Affordable housing program delivers first 1,500 units in Nairobi. The Housing Levy Increase has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the housing sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Court challenge filed against Housing Levy deductions",
      "description": "Court challenge filed against Housing Levy deductions. Housing Levy Increase continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_housing_levy/3",
      "source": "Daily Nation",
      "publishedAt": "2026-02-17T21:25:24.594880",
      "content": "Court challenge filed against Housing Levy deductions. The Housing Levy Increase has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the housing sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Workers union calls for Housing Levy suspension",
      "description": "Workers union calls for Housing Levy suspension. Housing Levy Increase continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_housing_levy/4",
      "source": "Business Daily",
      "publishedAt": "2026-02-16T08:25:24.594880",
      "content": "Workers union calls for Housing Levy suspension. The Housing Levy Increase has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the housing sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Government targets 200,000 housing units by 2027",
      "description": "Government targets 200,000 housing units by 2027. Housing Levy Increase continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_housing_levy/5",
      "source": "The Standard",
      "publishedAt": "2026-02-18T14:25:24.594880",
      "content": "Government targets 200,000 housing units by 2027. The Housing Levy Increase has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the housing sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    }
  ],
  "last_fetched": "2026-02-19T02:25:24.594880",
  "status": "ok",
  "query": "Housing Levy Increase"
}