{
  "articles": [
    {
      "title": "County revenue allocation formula faces Supreme Court challenge",
      "description": "County revenue allocation formula faces Supreme Court challenge. County Revenue Allocation continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_devolution/1",
      "source": "The Star",
      "publishedAt": "2026-02-17T03:25:24.594880",
      "content": "County revenue allocation formula faces Supreme Court challenge. The County Revenue Allocation has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the devolution sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Governors demand increased share of national revenue",
      "description": "Governors demand increased share of national revenue. County Revenue Allocation continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_devolution/2",
      "source": "The Standard",
      "publishedAt": "2026-02-17T19:25:24.594880",
      "content": "Governors demand increased share of national revenue. The County Revenue Allocation has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the devolution sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Devolution review commission proposes structural changes",
      "description": "Devolution review commission proposes structural changes. County Revenue Allocation continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_devolution/3",
      "source": "People Daily",
      "publishedAt": "2026-02-17T19:25:24.594880",
      "content": "Devolution review commission proposes structural changes. The County Revenue Allocation has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the devolution sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "County governments struggle with development budget execution",
      "description": "County governments struggle with development budget execution. County Revenue Allocation continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_devolution/4",
      "source": "The Standard",
      "publishedAt": "2026-02-18T15:25:24.594880",
      "content": "County governments struggle with development budget execution. The County Revenue Allocation has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the devolution sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "New equalization fund disbursement criteria announced",
      "description": "New equalization fund disbursement criteria announced. County Revenue Allocation continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_devolution/5",
      "source": "The Standard",
      "publishedAt": "2026-02-16T11:25:24.594880",
      "content": "New equalization fund disbursement criteria announced. The County Revenue Allocation has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the devolution sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    }
  ],
  "last_fetched": "2026-02-19T02:25:24.594880",
  "status": "ok",
  "query": "County Revenue Allocation"
}