{
  "articles": [
    {
      "title": "University funding model leaves students scrambling",
      "description": "University funding model leaves students scrambling. University Funding Model continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_education/1",
      "source": "People Daily",
      "publishedAt": "2026-02-16T14:25:24.594880",
      "content": "University funding model leaves students scrambling. The University Funding Model has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the education sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Higher education loans board overwhelmed with applications",
      "description": "Higher education loans board overwhelmed with applications. University Funding Model continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_education/2",
      "source": "People Daily",
      "publishedAt": "2026-02-17T17:25:24.594880",
      "content": "Higher education loans board overwhelmed with applications. The University Funding Model has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the education sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Parents protest new university fee structure",
      "description": "Parents protest new university fee structure. University Funding Model continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_education/3",
      "source": "Citizen Digital",
      "publishedAt": "2026-02-19T00:25:24.594880",
      "content": "Parents protest new university fee structure. The University Funding Model has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the education sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Government promises no student will miss education due to fees",
      "description": "Government promises no student will miss education due to fees. University Funding Model continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_education/4",
      "source": "Citizen Digital",
      "publishedAt": "2026-02-18T11:25:24.594880",
      "content": "Government promises no student will miss education due to fees. The University Funding Model has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the education sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    },
    {
      "title": "Vice-chancellors endorse new differentiated funding approach",
      "description": "Vice-chancellors endorse new differentiated funding approach. University Funding Model continues to dominate Kenyan policy discourse as stakeholders weigh in on the implications for ordinary citizens.",
      "url": "https://news.example.com/kenya/kenya_education/5",
      "source": "The Star",
      "publishedAt": "2026-02-16T05:25:24.594880",
      "content": "Vice-chancellors endorse new differentiated funding approach. The University Funding Model has been a subject of intense debate across Kenya. Analysts say the policy will have significant implications for the education sector. Various stakeholders including civil society groups, business associations, and county governments have expressed diverse opinions on the matter."
    }
  ],
  "last_fetched": "2026-02-19T02:25:24.594880",
  "status": "ok",
  "query": "University Funding Model"
}